rottenpotatoes/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar_movie
    id1 = params[:format]
    @movies = Movie.where(id: id1)



    director = String.new
    title = String.new
    @movies.each do |movie|
      title = movie.title
      director = movie.director
    end
    if( director.blank?)
      flash[:warning] = ("'#{title}' has no director info")
      redirect_to '/movies'
    end

    @similar_movie = Movie.where(director: director)